01 TEST.
   05 COLUMN01 PIC 9(03).
   05 COLUMN02 PIC 9(01)    BINARY.
   05 COLUMN03 PIC 9(04)    BINARY.
   05 COLUMN04 PIC 9(05)    BINARY.
   05 COLUMN05 PIC 9(09)    BINARY.
   05 COLUMN06 PIC 9(09)    COMP-3.
   05 COLUMN07 PIC 9(07)V99 COMP-3.
   05 COLUMN08 PIC X(29).